results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg10240-tps1000-batch16384-acksall-prod6-compnone-trial1/producer-perf-4.log
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=167
3 records sent, 0.6 records/sec (0.01 MB/sec), 518.0 ms avg latency, 561.0 ms max latency.
988 records sent, 195.7 records/sec (1.91 MB/sec), 2282.1 ms avg latency, 5017.0 ms max latency.
1529 records sent, 304.6 records/sec (2.98 MB/sec), 1784.6 ms avg latency, 3921.0 ms max latency.
845 records sent, 168.8 records/sec (1.65 MB/sec), 15.8 ms avg latency, 97.0 ms max latency.
831 records sent, 165.8 records/sec (1.62 MB/sec), 16.9 ms avg latency, 101.0 ms max latency.
843 records sent, 168.6 records/sec (1.65 MB/sec), 15.6 ms avg latency, 112.0 ms max latency.
835 records sent, 167.0 records/sec (1.63 MB/sec), 16.0 ms avg latency, 80.0 ms max latency.
838 records sent, 167.3 records/sec (1.63 MB/sec), 13.0 ms avg latency, 61.0 ms max latency.
837 records sent, 167.2 records/sec (1.63 MB/sec), 15.4 ms avg latency, 91.0 ms max latency.
834 records sent, 166.8 records/sec (1.63 MB/sec), 15.0 ms avg latency, 100.0 ms max latency.
837 records sent, 167.4 records/sec (1.63 MB/sec), 14.8 ms avg latency, 101.0 ms max latency.
840 records sent, 168.0 records/sec (1.64 MB/sec), 11.3 ms avg latency, 78.0 ms max latency.
836 records sent, 167.2 records/sec (1.63 MB/sec), 10.7 ms avg latency, 98.0 ms max latency.
835 records sent, 166.9 records/sec (1.63 MB/sec), 13.0 ms avg latency, 150.0 ms max latency.
835 records sent, 167.0 records/sec (1.63 MB/sec), 8.5 ms avg latency, 52.0 ms max latency.
836 records sent, 167.2 records/sec (1.63 MB/sec), 7.5 ms avg latency, 30.0 ms max latency.
836 records sent, 167.1 records/sec (1.63 MB/sec), 9.2 ms avg latency, 84.0 ms max latency.
835 records sent, 166.9 records/sec (1.63 MB/sec), 8.0 ms avg latency, 64.0 ms max latency.
836 records sent, 166.9 records/sec (1.63 MB/sec), 7.4 ms avg latency, 29.0 ms max latency.
16667 records sent, 166.900322 records/sec (1.63 MB/sec), 309.37 ms avg latency, 5017.00 ms max latency, 10 ms 50th, 2713 ms 95th, 3571 ms 99th, 3804 ms 99.9th.